---
kind: method
id: M:Autodesk.Revit.DB.DoubleArray.Clear
source: html/b7acc677-9276-859b-4423-22815a3753d0.htm
---
# Autodesk.Revit.DB.DoubleArray.Clear Method

Removes every double from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```